Repository: OpenChain-Project/Curriculum-Translation-JP
Catalog: Curriculum-Translation-JP-omegat.tmx
Source language: en_us
Languages: ja

source: "Distributed Compliance Artifacts" (as defined in the OpenChain specification), including appropriate notice files are included in the distribution package or other delivery method
ja: （ OpenChaint仕様書で定義されている）「頒布コンプライアンス関連資料（Distributed Compliance Artifacts）」が、適切な告知／通知／表示（notice）を盛り込んだ形で、頒布パッケージもしくはデリバリ形態に含まれている

source: "You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed...under the terms of this License."
ja: 「『プログラム』またはその一部を含む著作物、あるいは『プログラム』 かその一部から派生した著作物を頒布あるいは発表する場合には、その 全体をこの契約書の条件に従って第三者へ無償で利用許諾しなけれ ばならない。 」

source: 3rd Party Commercial
ja: サード パーティの商用

source: 3rd Party Software
ja: サード パーティ ソフトウェア

source: <<placeholder slide to identify where the FOSS policy can be found (OpenChain Specification 1.0, section 1.1.1)>>
ja: <<本スライドはFOSSポリシーが発見できる場所を明確にするためのページ（OpenChain仕様書1.0の1.1.1項）。プレースホルダ―として仮置き>>

source: Providing source code for original work, for combined work or modifications, as well as build scripts (scripts that control the build process)
ja: 原作、組み合せたもしくは改変した著作物に対しビルド用のスクリプト（ビルドプロセスを制御するスクリプト）と同様にソースコードを提供すること。

source: You should have a process for identifying, tracking and archiving a list of all FOSS components (and their respective identified licenses) from which your software is comprised.
ja: 自身のソフトウェアを構成することになる全てのFOSSコンポーネント（およびそれぞれで確認されたライセンス）を特定、追跡し、そのリストを書庫に保管するためのプロセスを持つ必要があります。

source: Your program should identify and handle typical FOSS use cases that result from your organization’s business practices.
ja: 自組織でのコンプライアンス プログラムは、業務遂行上生じる代表的なFOSSユースケースを認識し、これに対応する必要があります。

source: Example: Copyright © A. Person (2016).
ja: 例： Copyright © A. Person (2016).

source: A "license" is the way a copyright or patent holder gives permission or rights to someone else
ja: 「ライセンス」は、著作権や特許の保有者が他者に対し許諾や権利を供与するやり方

source: A FOSS Review alerts and engages the various support groups that work together to support, guide, coordinate and review the use of FOSS.
ja: FOSS レビューには、FOSSの使用を支援し、助言し、とりまとめやレビューを協力して行う各種支援グループがいます。こういったグループへ注意喚起しながら参加してもらいます。

source: A FOSS Review can be the meeting point for engineering, business and legal teams, and can require planning and organization to successfully conduct on a large scale.
ja: FOSSレビューはエンジニアリング、ビジネスおよび法務チームが集まる場となり得ます。大規模に首尾よく行うために、計画や組織を必要とする場合があります。

source: A complete list of OSI-approved licenses is available at http://www.opensource.org/licenses/
ja: OSIが承認したライセンスの全リストこちらで取得できます：http://www.opensource.org/licenses/

source: A compliance record is created (or updated) for the FOSS
ja: そのFOSSについてコンプライアンスの記録が作成（もしくはアップデート）される

source: A developer may copy portions of a FOSS component into your software product.
ja: 開発者はFOSSコンポーネントの一部を自身のソフトウェア プロダクトにコピーすることができます。

source: A developer may link or join a FOSS component with your software product.
ja: 開発者はFOSSコンポーネントを自身のソフトウェアプロダクトとリンクもしくは接合する（join）ことができます。

source: A developer may make changes to a FOSS component, including:
ja: 開発者はFOSSコンポーネントに対して変更を加えることができます。次のようなものがあります：

source: A developer may transform the code from one state to another.
ja: 開発者は、コードをある状態から異なる状態に変換することができます。

source: A key element to a FOSS Compliance Program is a FOSS Review process, through which a company can analyze and determine its FOSS obligations
ja: FOSS コンプライアンス プログラムについて重要となる要素はFOSS レビューのプロセスです。これを通じ企業はFOSSに関する義務を分析し決定することができます。

source: A patent license?
ja: 特許の場合は？

source: A proprietary software license (or commercial license or EULA) has restrictions on the usage, modification or distribution of the software
ja: プロプライエタリ ソフトウェア ライセンス（商用ライセンス、もしくはEULA）はソフトウェアの使用、改変もしくは再頒布についての制約を有します。

source: A public domain declaration attempts to waive or eliminate any intellectual property rights that the developers may have in the software to make it clear that it can be used without restriction, but the enforceability of these declarations is subject to dispute within the FOSS community
ja: パブリック ドメイン宣言とは、開発者がそのソフトウェアで保有できる、あらゆる知的財産権を放棄もしくは消滅させるための試みのことで、制約なくそのソフトウェアが使用できることを明示します。しかしこの宣言の執行可能性についてはFOSSコミュニティにおける議論が必要となります。

source: A resolution for each of the flagged files in the report and a resolution for any flagged license conflict
ja: レポートの中でフラグの立てられたそれぞれのファイルに対する解決とライセンスの不一致の解消

source: A source code audit or scan has been completed
ja: ソースコード監査もしくはスキャンが完了している

source: A FOSS compliance program provides various benefits such as an increased understanding of how FOSS impacts your organization, an increased understanding of the costs and risks associated with FOSS, better relations with the FOSS community and increased knowledge of available FOSS solutions.
ja: FOSS コンプライアンスプログラムは、さまざまなメリットを提供します。たとえばFOSSが組織にどうインパクトを与えるかという点や、FOSSに関連づけられるコストやリスクについての理解の向上、またFOSSコミュニティとのよりよい関係、有効なFOSSソリューションについての知識の向上といった点があります。

source: Accompanying Source Code Distribution
ja: ソースコードを添付して頒布する

source: Accompanying Source Code Distribution – Make source code available as needed.
ja: 添付ソースコードの頒布－ソースコードを必要に応じて入手可能にします。

source: Accompanying source code distribution
ja: 添付ソースコードの頒布

source: Accompanying source code is identified with labels as to which product and version to which it corresponds
ja: 添付ソースコードが製品と版数に対応して識別される

source: Accompanying source code is provided as may be required
ja: 添付ソースコードが要求された通りに提供されている

source: Acknowledge the use of FOSS by providing full copyright and attribution notices
ja: 著作権表示と帰属表示の全てを提供することで、FOSSの使用を認める

source: Adapting
ja: 適応させる（Adapting）

source: Adding
ja: 追加

source: Adding/injecting new code into the FOSS component
ja: FOSSコンポーネントへの新たなコードの追加／注入（Adding/injecting）

source: All identified issues have been resolved
ja: 全ての確認された問題が解決されている

source: All pre-distribution verification has been completed and no issue is discovered
ja: すべての頒布前検証が完了し、問題が発見されていない

source: Alternatively, the contents of this file may be used under the terms of - either the GNU General Public License Version 2 or later (the "GPL"), or - the GNU Lesser General Public License Version 2.1 or later (the "LGPL"), - in which case the provisions of the GPL or the LGPL are applicable instead - of those above.
ja: このファイルの内容は、上記に代えて、GNU General Public License Version 2 以降 のライセンス（ 「GPL」ライセンス）、もしくは - GNU Lesser General Public License Version 2.1以降 のライセンス( 「LGPL」ライセンス) ライセンスの条件に従って使用することも可能です。この場合、このファイルの使用には上記の条項ではなく GPLもしくはLGPL ライセンスの条項が適用されます

source: An audit is requested to scan or review the source code
ja: ソースコードのスキャンもしくはレビューのための監査が要請される

source: An audit report identifies the origins and licenses of the source code and flags files that need further investigation
ja: 監査レポートがソースコードの起源とライセンスを特定していて、さらなる追及が必要がファイルにフラグが立てられている（マークされている）

source: An audit report identifying the origins and licenses of the source code
ja: ソースコードの起源とライセンスの確認をした監査レポート

source: An example of this would be FFMpeg, which is a free software project that provides the codecs for encoding and decoding videos. However, you would still need a patent license to encode and decode a certain format.
ja: 一つの例としてFFMpeg があります。これはビデオの符号化／復号化のためのコーデック機能を提供するフリー ソフトウェア プロジェクトですが、何らかのフォーマットを符号化／復号化をするには特許ライセンスが必要となるでしょう。

source: Analyze and determine license obligations
ja: ライセンスの義務の分析と決定

source: Analyzing Proposed FOSS Usage
ja: 提案されたFOSSの使用を分析する

source: Applications downloaded to a user’s machine or mobile device
ja: ユーザ機器やモバイルデバイスにダウンロードされるアプリケーション

source: Appropriate notices have been prepared
ja: 適切な告知／通知／表示（notice）が準備された

source: Approval information from the previous step should be tracked or registered so that anyone releasing the software can understand and comply with the relevant license obligations.
ja: 前ステップから承認された情報はそのソフトウェアをリリースする誰もが理解し、関連するライセンスの義務を履行できるよう、登録され、追跡される必要があります。

source: Approvals
ja: 承認（Approval）

source: Approvals - Communicate approval conditions and license obligations.
ja: 承認－承認の条件とライセンスの義務を明らかにします。

source: Approvals should be made at appropriate authority levels
ja: 承認は適切な権限（職権）レベルにてなされる必要があります。

source: Architecture Review (Example Template)
ja: アーキテクチャ レビュー（テンプレートの例）

source: Architecture reviews examine the relationships between FOSS components and company software.
ja: アーキテクチャ レビューではFOSSコンポーネントと企業のソフトウェアの間の関係を検査します。

source: Are Freeware and Shareware software considered FOSS?
ja: フリーソフトウェアとシェアウェアはFOSSとみなされますか？

source: Attribution and Notices. Inclusion of copyright and license text in the source code and/or product documentation or user interface, so that downstream users know the origin of the software and their rights under the licenses
ja: 帰属表示（Attribution and Notices）。 下流のユーザがソフトウェアの起源やライセンス下の権利を知ることができるよう、ソースコードもしくは製品の関連文書もしくはユーザ インターフェース内に著作権やライセンスに係る文字列を含めること。

source: Attribution notice - a notice included in the product release that acknowledges the identity of the original authors of the FOSS included in the product.
ja: 帰属表示（Attribution notice） －製品リリースに含まれる、原作者の証としてこれを知らせる表示

source: Audit
ja: 監査（Audit）

source: Audit source code
ja: ソースコードの監査（Audit source code）

source: Auditing Source Code
ja: ソースコードを監査する

source: Auditing source code - Review identified FOSS components for license and origin information.
ja: ソースコードの監査－確認されたFOSSコンポーネントをライセンスと起源についてレビューします。

source: Audits or scans are performed iteratively based on the software development and release lifecycles
ja: ソフトウェア開発やリリース ライフサイクルをベースに監査もしくはスキャンが繰り返し実施される

source: Automated source code
ja: ソースコードの

source: Availability of source code
ja: ソースコードの入手しやすさ

source: Avoidance
ja: 回避策

source: Avoiding Compliance Pitfalls
ja: コンプライアンスで陥る落とし穴を回避する

source: Based on the results of the software audit and review in previous steps, software may or may not be approved for use
ja: 前ステップのソフトウェア監査およびレビューの結果に基づき、ソフトウェアの使用が承認、否認されます。

source: Basic rule = copyright protects creative works
ja: 基本ルール＝著作権は独創的作品を保護する

source: Because FOSS licenses usually apply during distribution, this is a key point to consider in a compliance program.
ja: これはFOSSライセンスは通常、頒布の期間中に適用されるものであるためです。この点はコンプライアンスプログラムで考慮すべき重要なポイントです。

source: Benefits of a robust FOSS Compliance program include:
ja: ロバストなFOSSコンプライアンス プログラムのメリットには以下が挙げられる：

source: Better relations with the FOSS community and FOSS organizations
ja: FOSSコミュニティやFOSS関連組織と関係を良くする

source: Binary delivery
ja: バイナリでのデリバリ

source: Business and engineering teams may receive and implement guidance
ja: ビジネスおよびエンジニアリングチームはその助言を受け取り、実行に移します。

source: Can software be subject to a patent?
ja: ソフトウェアが特許を受けることができますか？

source: Changes to the existing program (e.g., additions, deletions of code in a file, combining components together)
ja: 今あるプログラムに対する変更（例：ファイル中にあるコードの追加、削除やコンポーネントの組み合わせ）

source: Changing
ja: 変更

source: Chapter 1
ja: 第1章

source: Chapter 2
ja: 第2章

source: Chapter 3
ja: 第3章

source: Chapter 4
ja: 第4章

source: Chapter 5
ja: 第5章

source: Chapter 6
ja: 第6章

source: Chapter 7
ja: 第7章

source: Check Your Understanding
ja: 理解度チェック

source: Check information for completeness, consistency and accuracy.
ja: 完全性、一貫性と正確性について情報をチェックすることです。

source: Combining
ja: 結合（Combining）

source: Common scenarios include:
ja: 共通するシナリオとしては以下があります：

source: Community project
ja: コミュニティ プロジェクト

source: Compile notices
ja: 公開に向けて

source: Compiling VHDL in a mask or net list
ja: VHDLのマスクパターンもしくはネットリストへのコンパイル

source: Compiling into binary
ja: バイナリへのコンパイル

source: Completeness, consistency, accuracy (code scanning tools may be used to scan for undisclosed FOSS usage)
ja: 完全性、一貫性、正確性（公表されていないFOSSの使用についてはコード スキャンツールが使われることがあります）

source: Compliance Benefits
ja: コンプライアンスのメリット

source: Compliance Pitfalls
ja: コンプライアンスの落とし穴

source: Compliance Process
ja: コンプライアンス プロセス

source: Compliance Process pitfalls
ja: コンプライアンスのプロセスの 落とし穴

source: Compliance management consists of a set of actions that controls the intake and distribution of FOSS used in products (or "Supplied Software" in the OpenChain specification)
ja: コンプライアンス マネジメントは、製品の中で使われるFOSS（もしくはOpenChain 仕様書の中の「供給ソフトウェア」）の取込みと頒布をコントロールする、一通りのアクションで構成されます。

source: Conduct FOSS Reviews on audited source code, review software architecture and FOSS usage (see next slide for template)
ja: 監査されたソースコード、ソフトウェアアーキテクチャ、およびFOSSの利用方法（次頁テンプレート参照）についてFOSSレビューを実施する

source: Conducting regular source code scans or audits for all the source code in the build environment (proprietary, 3rd party and FOSS)
ja: ビルド環境におけるすべてのソースコード（プロプライエタリ、サード パーティ、FOSS）に対し定期的にソースコードスキャンや監査を実施する。

source: Confirm origin and
ja: ソースコードの起源および

source: Consumer and brand protection; avoid consumer confusion and brand dilution
ja: 消費者とブランドを守る；消費者の混乱やブランドの希薄化を回避する

source: Contents
ja: コンテンツ

source: Contribute and participate in open communities
ja: オープンなコミュニティに参加し、コントリビュートする

source: Converting C++ to Java
ja: C++ からJavaへの変換

source: Copyleft licenses may include source availability obligations
ja: コピーレフト ライセンスは、ソースが使用できる状態にあることを義務づける場合があります。

source: Copyleft-style licenses often have source availability obligations, which require you to provide accompanying source code when you distribute a binary version of a program or library.
ja: コピーレフト スタイルのライセンスには多くの場合、ソース取得についての義務があり、プログラムやライブラリのバイナリ版を頒布する場合にソースコードを添付することを求めます。

source: Copyright concepts in software
ja: ソフトウェアにおける著作権（コピーライト）の概念

source: Copyright generally applies to literary works, such as books, movies, pictures, music, maps
ja: 一般的に著作権は、書籍、動画、絵画、音楽、地図などの文芸作品

source: Copyright notice - an identifier placed on copies of the work to inform the world of copyright ownership.
ja: 著作権表示（Copyright notice） －その著作物の著作権保有者を社会に知らしめるべく、写し（copy）に掲載される識別子のこと

source: Copyright notices
ja: 著作権表示

source: Copyright notices, attribution, source code for vendor modifications if needed to satisfy license obligations
ja: 、著作権表示、帰属表示、およびライセンスの義務を果たす必要がある場合のベンダー改変にあたるソースコード

source: Copyright protects original works of authorship.It's different than patent in that copyright protects the expression of an idea, whereas patent protects the underlying idea itself.
ja: 著作権は原作者の原作を保護します。著作権がアイデアの表現を保護するのに対し、特許が根底にあるアイデアそのものを保護している点で異なります。

source: Copyright rights most relevant to software
ja: ソフトウェアにもっとも関係する著作権

source: Copyright: protects original works of authorship
ja: 著作権（コピーライト）：著作者の原作を保護する

source: Creating interdependency
ja: 相互依存性の創出（Creating interdependency）

source: Curriculum
ja: カリキュラム

source: Customer/Partner
ja: 顧客／パートナー

source: Deleting
ja: 削除

source: Deleting or removing code
ja: コードの削除（Deleting）もしくは除去（Removing）

source: Depending on the FOSS license used, you may need to comply with one or more of the following types of conditions and restrictions:
ja: 使用するFOSSによっては以下の条件や制約のうち1つもしくはそれ以上に応じる必要があります。

source: Depending on the license(s) involved, obligations could consist of:
ja: 関与するライセンスにもよりますが、義務として以下のようなものがありえます。

source: Description
ja: 説明

source: Description of modifications
ja: 改変に関する記述

source: Developers may include a public domain declaration with their software
ja: 開発者は自身のソフトウェアとともにパブリック ドメイン宣言 を含めることができます。

source: Development Tools
ja: 開発ツール

source: Development team provides a compliance record with information about the FOSS usage
ja: 開発チームがFOSSの使用についての情報のあるコンプライアンスの記録を提供する

source: Development team's point of contact
ja: 開発チームのコンタクト ポイント

source: Development team's point of contact in case you need to follow up with future FOSS issues.
ja: 将来のFOSSの問題を追跡するために必要となる、開発チームのコンタクト ポイントです。

source: Development tools may perform some of these operations behind the scenes.
ja: これらの操作のいくつかを裏方として開発ツールが実行してくれる場合があります。

source: Different legal jurisdictions may have different legal requirements.
ja: 法域が異なる場合においては法的要求事項が異なる場合がありますので

source: Different use cases will have different legal effects.
ja: ユースケースが異なれば法的効果も違ってきます。

source: Discovery
ja: 発見のされ方

source: Discovery of FOSS being used as part of third party software
ja: サード パーティのソフトウェアの一部に使用されているFOSSを発見する

source: Discovery of FOSS being used without proper authorization
ja: 適切な承認がなく使用されているFOSSを発見する

source: Disjunctive licensing may be something important to explore more deeply when creating a FOSS policy.
ja: 離接的なライセンスは、 FOSSポリシーを策定する際により深く調査するべく、重要かもしれません。

source: Disjunctive = Choice of one open source license or another
ja: 離接的（Disjunctive） ＝どちらから一つのオープンソース ライセンスを選択します。

source: Dissemination of material to an outside entity
ja: 外部に対する資料の散布

source: Distribution
ja: 頒布（Distribution）

source: Distribution is generally viewed as the provision of a copy of a piece of software in binary or source code form to another entity (an individual or organization outside your company or organization)
ja: 配布とは、一般的に、ソフトウェア部品のコピーをバイナリもしくはソースコードの形態である実体（個人や外部の企業や組織）からある実体へ提供する行為とみなされます。

source: Do not restrict others of the rights granted under the original license
ja: 原作のライセンスの下で供与された権利によって他者を制約すること

source: Do not use the project or copyright holder name or trademark
ja: プロジェクト名、著作権保有者名、商標を使用しないこと

source: Does not protect abstract ideas, laws of nature
ja: 抽象的なアイデアや自然法則は保護しない

source: Does the declared license match what is in the code files?
ja: 宣言されたライセンスがコードファイルにある内容と合っていますか？

source: Does the license truly permit the proposed use of the software?
ja: そのライセンスが提案されているソフトウェアの使用を本当に許容していますか？

source: Due diligence on any 3rd party provided software
ja: サードパーティ提供のソフトウェアに対する適正評価（Due delligence）を実施する

source: E.g, provide attribution, give a reciprocal license
ja: 例）帰属を提供する、互恵的ライセンスを供与する

source: E.g., when software is “dual licensed,” recipients can choose to use or distribute the software under a choice of two licenses
ja: 例：ソフトウェアが「デュアルライセンス」であるとき、受け手はそのソフトウェアの使用もしくは頒布について、ふあっつのライセンスの選択肢から選択することができます。

source: End to End Compliance Management (Example Process)
ja: エンド ツー エンド（端から端まで）のコンプライアンス マネジメント（プロセスの例）

source: Engineer
ja: エンジニア

source: Engineering or developer teams may participate in gathering relevant information
ja: 関連情報収集においてエンジニアリングもしくは開発チームが参加することもあります。

source: Ensure the software in the audit report conforms with FOSS policies
ja: 監査レポートにあるソフトウェアがFOSSポリシーと合致することを確かなものとする

source: Ensure you have the notices and source code as needed to meet these obligations.
ja: そういった義務を果たすべく必要性に応じて告知／通知／表示（notice）やソースコードがあることを確かめましょう。

source: Example of Compliance Management End-to-End Process
ja: コンプライアンス マネジメントのエンド ツー エンドプロセスの例

source: Example of license reciprocity from the GPL version 2.0:
ja: GPL version 2.0よりライセンス互恵性の例：

source: Example:
ja: 例）

source: Example: BSD-3-Clause
ja: 例：三条項BSDライセンス

source: Examples include:
ja: 例として以下のようなものがあります：

source: Examples of copyleft-style licenses include GPL and LGPL.
ja: コピーレフト スタイルのライセンスにはGPL、LGPLといったものがあります。

source: Examples of permissive FOSS licenses include MIT, BSD, and Apache.
ja: パーミッシブなFOSSライセンスの例としてはMIT、BSD、Apacheライセンスがあります。

source: Examples of works of authorship include photographs, songs, and computer code.
ja: 原作者の作品としては、写真、歌、コンピューターの符号などが含まれます。

source: Exclusive or non-exclusive terms
ja: 独占的な期間、非独占的な期間

source: Executive Review Committee
ja: レビュー実行委員会

source: External distribution
ja: 外部への頒布

source: FOSS + Mods
ja: FOSS + 改変

source: FOSS Compliance Goals
ja: FOSSコンプライアンスのゴール

source: FOSS Compliance Program
ja: FOSSコンプライアンス プログラム

source: FOSS Compliance Triggers: Distribution
ja: FOSSのコンプライスが発動されるトリガー：頒布

source: FOSS Compliance Triggers: Modification
ja: FOSSのコンプライスが発動されるトリガー：改変

source: FOSS Conditions & Restrictions
ja: FOSSにおける条件と制約

source: FOSS Licenses
ja: FOSS（フリー／オープンソース ソフトウェア）ライセンス

source: FOSS Notices may include information about the identity of the copyright holders and the license governing the software.
ja: FOSSの告知／通知／表示（Notice）は、著作権保有者の証や、そのソフトウェアをコントロールするライセンスについての情報を含む場合があります。

source: FOSS Notices may provide notice about modifications.
ja: FOSSの告知／通知／表示（Notice）が改版のついての告知を提供する場合もあります。

source: FOSS Permissive
ja: FOSS パーミッシブ

source: FOSS Policy
ja: FOSS ポリシー、方針、方策

source: FOSS Review
ja: FOSS レビュー

source: FOSS Review Oversight
ja: FOSS レビューの監督

source: FOSS Review Team
ja: FOSS レビューチーム

source: FOSS Training Reference Deck, Version 2 FINAL DRAFTDesigned for the OpenChain Specification 1.0
ja: FOSSトレーニング参照資料 第2版 最終ドラフトOpenChain 仕様書 第1.0版対応

source: FOSS compliance means following the licensing terms of FOSS licenses.
ja: FOSSコンプライアンスは、FOSSのライセンス 条項に従うことを意味します。

source: FOSS component has been approved for usage
ja: FOSSコンポーネントの使用が承認された

source: FOSS component has been registered in the software inventory for the release
ja: FOSSコンポーネントがそのリリースに対しソフトウェア一覧（inventory）に登録された

source: FOSS developers often use the term "proprietary" to describe a commercial non-FOSS license even though both FOSS and proprietary licenses are based on intellectual property and provide a license grant to that property
ja: FOSSの開発者たちはしばしば「プロプライエタリ」を商用のFOSSでないライセンスを言い表す際に用いますが、FOSSとプロプライエタリ、どちらのライセンスも知的財産に基づき、 その財産にライセンスを付与するものです。

source: FOSS identified;
ja: 確認されたFOSS；

source: FOSS licenses are Free and FOSS Software licenses generally make source code available under terms that allow for modification and redistribution.
ja: FOSSライセンスはフリー、FOSSソフトウェア ライセンスで、一般に改変と再頒布を許容する条件の下でソースコードを取得可能にするものです。

source: FOSS licenses may also require the placement of notices in source code or documentation to give credit to the author (an attribution) or to make it clear the software includes modifications.
ja: また、FOSSライセンスは告知／通知／表示のソースコードや文書類における場所を要求する場合があります。これは著作者の功績を称えたり（帰属表示として）、そのソフトウェアが改変されたことを明確にさせたりするためです。

source: FOSS licenses may have conditions related to providing attributions, copyright statement preservation, or a written offer to make the source code available
ja: FOSSライセンスには、帰属の提供や著作権宣言文の維持もしくはソースコードが取得できる「書面による申し出（Written offer)」に係る条件を有する場合があります。

source: FOSS obligations met
ja: 履行されるFOSSの義務

source: FOSS source code
ja: FOSSソースコード

source: Facilitate effective usage of FOSS in commercial products
ja: 商用製品におけるFOSSの効果的使用を容易にする

source: Final Verifications
ja: 最終確認

source: First product release that will include the package
ja: そのパッケージを含んだ製品のファーストリリース（最初の公開・販売）

source: First, you may need to follow up with the vendor if FOSS issues arise in the future, and having a reliable point of contact is important. You may also need to meet FOSS license obligations for FOSS delivered from the vendor.
ja: まず、将来的にFOSSに関する問題が生じた場合、そのベンダーを追跡調査する必要があるかもしれません。その際に信頼できるコンタクト先が重要となります。またベンダーから引き渡されたFOSに対しライセンスの義務を果たす必要があるかもしれません。

source: Fixing
ja: 修正

source: Fixing, optimizing or making changes to the FOSS component
ja: FOSSコンポーネントへの修正（Fixing）, 最適化（optimizing）もしくは変更（making change）

source: Follow up with engineers to confirm that the issues are resolved
ja: 問題が解決されたことをエンジニアとともに確認する

source: For example, a tool may inject portions of its own code into output of the tool.
ja: たとえば、あるツールでは自身のコードを出力ファイルに注入してくれます。

source: For example, an open source software can be dual-licensed under MIT and GPLv2.
ja: 例えば、あるオープンソース ソフトウェアはMITとGPLv2の2つのライセンスを付与することができます。

source: For example, how are FOSS and company components linked together?
ja: 例えば、FOSSと企業のコンポーネントは一緒にリンクされるのか？といったことです。

source: For example, the earlier steps may have identified a FOSS component that contains other FOSS code under an incompatible license.
ja: 例えば、始めのステップで両立しないライセンス下にある他のFOSSコードを含むFOSSコンポーネントを特定したとします。

source: For example, code scanning may be used to locate undisclosed FOSS usage.
ja: 例えば、公開されていないFOSSの利用を見つけるためにコードスキャンツールが使われることがあります。

source: For more on dual-licensing as a business model: http://oss-watch.ac.uk/resources/duallicence2
ja: ビジネスモデルとしてのデュアル ライセンスについての詳細はこちら： http://oss-watch.ac.uk/resources/duallicence2

source: For our example process, the steps include:
ja: ここでのプロセスで以下のステップがありました。

source: For some FOSS licenses, access via a computer network can be a “trigger event.” The trigger is"users interacting with it remotely through a computer network."
ja: いくつかのFOSSライセンスについては、コンピュータ ネットワークを通じたアクセスが「トリガー イベント」となり得ます。そのトリガーとは「コンピュータ ネットワークを通じユーザがリモートでそれ（そのFOSS）と相互に作用すること」です。

source: For some licenses, you may also need to include a full copy of the license text.
ja: いくつからのライセンスについては、ライセンス全文の写しを含める必要があります。
